gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_PROXY.c
						if(UARTCtrlProxy->ProxyTask==0)//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
						{
							if(UARTCtrlProxy->ProxyTxRxByte==0)
							{//无数据接收
								if(NUM_ReTx<NUMmax_ReTx)//代理重发次数
								{
									NUM_ReTx++;//代理重发次数
									UARTCtrlProxy->ProxyTxRxByte=i+2+4;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
									UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
									continue;
								}
							}
							break;
						}
					}
				}
			//代理返回数据
				if(UARTCtrlProxy->ProxyTxRxByte==0)
				{//无数据接收
					if(LENmax_TxSPACE<(4+LEN_RCSD+2))
					{
						LEN_TxAPDU=0;//发送缓冲不够
						break;
					}
					MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);//OAD
					MR((u32)p8tx+LEN_TxAPDU+4,(u32)p8OAD+4+LEN_RSD,LEN_RCSD);//RCSD
					LEN_TxAPDU+=4+LEN_RCSD;
					p8tx[LEN_TxAPDU+0]=0;
					p8tx[LEN_TxAPDU+1]=33;//请求超时 
					LEN_TxAPDU+=2;
					LENmax_TxSPACE-=4+LEN_RCSD+2;
				}
				else
				{
					p8Data-=4;//前有p8Data+=4;
				#if ((USER%100)==0)||((USER/100)==9)//电科院,河南
					//明文读取
				#else
					//明文+数据验证码读取
					i=p8Data[1]+(p8Data[2]<<8);
					if(i>=(14+3))
					{
						i-=(14+3);
					}
					if((p8Data[16]&0x80)==0)
					{
						MR((u32)p8Data+14,(u32)p8Data+14+3,i);
					}
					else
					{
						if((p8Data[16]&0x7f)==1)
						{//1byte长度
							MR((u32)p8Data+14,(u32)p8Data+14+4,i);
						}
						else
						{//2byte长度
							MR((u32)p8Data+14,(u32)p8Data+14+5,i);
						}
					}
				#endif
					i=17;
					NUM_OAD=p8Data[17+4];//RCSD个数
					LEN_RCSD=5*NUM_OAD;
					LEN_RCSD+=1;
					if(p8Data[17+4+LEN_RCSD]==0)
					{//0=返回错误
						if(LENmax_TxSPACE<(4+LEN_RCSD+2))
						{
							LEN_TxAPDU=0;//发送缓冲不够
							return;
						}
						MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data+17,4+LEN_RCSD+2);
						LEN_TxAPDU+=4+LEN_RCSD+2;
						LENmax_TxSPACE-=4+LEN_RCSD+2;
					}
					else
					{//1=返回data
						x=p8Data[17+4+LEN_RCSD+1];//M条记录
						LEN_RCSD+=4+2;
						while(x--)
						{
							for(i=0;i<NUM_OAD;i++)//RCSD个数
							{
								offset=Get_DL698DataLen_S(p8Data+17+LEN_RCSD,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
								LEN_RCSD+=offset;
							}
						}
						if(LENmax_TxSPACE<LEN_RCSD)
						{
							LEN_TxAPDU=0;//发送缓冲不够
							return;
						}
						MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data+17,LEN_RCSD);
						LEN_TxAPDU+=LEN_RCSD;
						LENmax_TxSPACE-=LEN_RCSD;
					}
				}
			}
			else
			{//Err=1
					if(LENmax_TxSPACE<(4+LEN_RCSD+2))
					{
						LEN_TxAPDU=0;//发送缓冲不够
						break;
					}
					MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);//OAD
					MR((u32)p8tx+LEN_TxAPDU+4,(u32)p8OAD+4+LEN_RSD,LEN_RCSD);//RCSD
					LEN_TxAPDU+=4+LEN_RCSD;
					p8tx[LEN_TxAPDU+0]=0;
					p8tx[LEN_TxAPDU+1]=255;//其他错误
					LEN_TxAPDU+=2;
					LENmax_TxSPACE-=4+LEN_RCSD+2;
			}
			break;
		case 3://代理设置若干个服务器的若干个对象属性请求             [3] ProxySetRequestList，
//ProxySetRequestList∷=SEQUENCE
//{
//  服务序号-优先级         PIID，
//  整个代理请求的超时时间  long-unsigned，
//  代理若干个服务器的对象属性设置  SEQUENCE OF
//  {
//    一个目标服务器地址        TSA，
//    代理一个服务器的超时时间  long-unsigned，
//    若干个对象属性描述符及其数据  SEQUENCE OF
//    {
//      对象属性描述符  OAD，
//      及其数据        Data
//    }
//  }
//}		
//68 2D 00 43 05 04 00 00 00 00 00 10 C2 82 09 03 0A 
//00 1E  整个代理请求的超时时间  long-unsigned
//01   代理若干个服务器的对象属性设置  SEQUENCE OF
//07 05 00 00 00 00 00 01  一个目标服务器地址        TSA
//00 00  代理一个服务器的超时时间  long-unsigned
//01  若干个对象属性描述符及其数据  SEQUENCE OF
//40 00 02 00 对象属性描述符  OAD
//1C 07 E1 07 02 0D 22 02  及其数据        Data
//00 E9 6B 16 
//ProxySetResponseList∷=SEQUENCE
//{
//  服务序号-优先级-ACD   PIID-ACD，
//  代理若干个服务器的读取结果  SEQUENCE OF
//  {
//一个目标服务器地址  TSA，
//若干个对象属性描述符及其结果  SEQUENCE OF
//{
//      对象属性描述符  OAD，
//      及其设置结果    DAR
//}
//  }
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=137;//代理响应        	[137]	PROXY-Response
			p8tx[1]=3;// [3] ProxySetRequestList
			p8tx[2]=p8rx[LEN_SA+8+2];//PIID-ACD
			LEN_TxAPDU=3;
			LENmax_TxSPACE-=LEN_TxAPDU;
			
			offset=LEN_SA+8+3;
			//整个代理请求的超时时间
			p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//得到UART秒定时器地址
			i=(p8rx[offset]<<8)|p8rx[offset+1];
			p16[0]=i;
			offset+=2;
			//服务器个数
			p8tx[3]=0;
			NUM_TSA=p8rx[offset];
			offset++;
			LEN_TxAPDU++;
			LENmax_TxSPACE--;
			while(NUM_TSA--)
			{
				// 一个目标服务器地址         TSA
				p16=(u16*)(ADDR_DATABUFF);
				p16[0]=0;
				p16[1]=0;
				p16[2]=0;
				i=p8rx[offset+1];//TSA字节数
				i++;
				MR(ADDR_DATABUFF,(u32)p8rx+offset+2,i);
				UARTCtrl->RMAddr[0]=p16[0];
				UARTCtrl->RMAddr[1]=p16[1];
				UARTCtrl->RMAddr[2]=p16[2];
				
				SETno=AddrToMeterSetNo((u16*)(ADDR_DATABUFF));//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=RMNmax表示无效
				Err=1;//置错误
				if(SETno<NUM_RMmax)
				{//找到配置序号
					p8=(u8*)ADDR_6000_SDRAM+(SETno*LENper_6000);
					if(p8[0]==DataType_structure)
					{//配置有效
						p8=Get_Element(p8+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
						if(p8)
						{//找到端口号
							ProxyPORTn=(p8[1]<<24)+(p8[2]<<16)+(p8[3]<<8)+p8[4];//端口OAD
							ProxyPORTn=OADtoPORTn(ProxyPORTn);//OAD值转为通信口号
							if(ProxyPORTn==ACSAMPLEPORT)
							{
								UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ProxyPORTn);
								Err=0;
							}
						#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT)||(ProxyPORTn==RS485_4PORT))
						#endif
						#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT))
						#endif
						#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT)||(ProxyPORTn==RS485_4PORT))
						#endif
						#if ((Project/100)<2)||((Project/100)>4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT))
						#endif
							{
								UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ProxyPORTn);
								if(UARTCtrlProxy->Function)//口功能 0=终端维护口,!=0终端抄表口
								{
									if(UARTCtrlProxy->AutoSearchTask==0)//自动搜表任务:0=空,1=等待,2...过程
									{
										UARTCtrlProxy->ProxyPORTn=PORTn;//发起代理的端口号
										p8=(u8*)ADDR_6000_SDRAM+(SETno*LENper_6000);
										p8=Get_Element(p8+5,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
										if(p8)
										{//波特率
											i=p8[1];
											switch(i)
											{
												case 0://300
												case 1://600
												case 2://1200
												case 3://2400
												case 4://4800
												case 5://7200
												case 6://9600
												case 7://19200
												case 8://38400
												case 9://57600
												case 10://115200
													UARTCtrlProxy->ProxyBpsCtrl=(0xb+(i<<5));
													break;
												case 255://自适应
												default:
													UARTCtrlProxy->ProxyBpsCtrl=RS485DefaultBPS;//RS485口默认的速率控制码0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
													break;
											}
											UARTCtrlProxy->ProxyRMprotocol=p8[3];//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
										}
										Err=0;
									}
								}
							}
						}
					}
				}
				i=p8rx[offset];//TSA字节数
				i++;
				if(LENmax_TxSPACE<i)
				{
					LEN_TxAPDU=0;//发送缓冲不够
					break;
				}
				MR((u32)p8tx+LEN_TxAPDU,(u32)p8rx+offset,i);
				offset+=i;
				LEN_TxAPDU+=i;
				LENmax_TxSPACE-=i;
				//代理一个服务器的超时时间
				i=(p8rx[offset]<<8)|p8rx[offset+1];
				if(Err==0)
				{
					UARTCtrlProxy->ProxyOverTime=i;//代理1个服务器的超时时间秒
				}
				offset+=2;
				//SEQUENCE OF OAD
				p8OAD=p8rx+offset;//当前需发送OAD个数及数值指针
				NUM_OAD=p8rx[offset];
				offset+=1;
			//组发送帧
				p8Data[0]=0xfe;
				p8Data[1]=0xfe;
				p8Data[2]=0xfe;
				p8Data[3]=0xfe;
				p8Data+=4;
			//起始字符（68H）  1Byte
				p8Data[0]=0x68;
			//长度域L  2Byte(除起始字符和结束字符之外的帧字节数)
			//控制域C  1Byte
				p8Data[3]=0x43;
			//地址域A
				p8Data[4]=5;
				p8Data[5]=UARTCtrl->RMAddr[2]>>8;
				p8Data[6]=UARTCtrl->RMAddr[2];
				p8Data[7]=UARTCtrl->RMAddr[1]>>8;
				p8Data[8]=UARTCtrl->RMAddr[1];
				p8Data[9]=UARTCtrl->RMAddr[0]>>8;
				p8Data[10]=UARTCtrl->RMAddr[0];
			//客户机地址CA  1Byte
				p8Data[11]=CA;
			//帧头校验HCS  2Byte(帧头校验HCS为2字节，是对帧头部分除起始字符和HCS本身之外的所有字节的校验)
			//APDU
				p8Data[14]=6;//设置请求 			 [6]		SET-Request
				p8Data[15]=2;//设置若干个对象属性请求     	[2] SetRequestNormalList
				UARTCtrl->PIID++;
				p8Data[16]=UARTCtrl->PIID&0x3f;//PIID
				p8Data[17]=NUM_OAD;
				
				i=0;
				for(x=0;x<NUM_OAD;x++)
				{
					LEN_RSD=Get_DL698DataLen_S(p8rx+offset+i+4,0);//得到DL698数据类型长度(包括:类型字节和数据)
					i+=4+LEN_RSD;
				}
				if(i>(LEN_UART2Tx-(4+18+4)))
				{
					LEN_TxAPDU=0;
					break;
				}
				MR((u32)p8Data+18,(u32)p8rx+offset,i);
				offset+=i;
				i+=18;
			//时间标签
				p8Data[i]=0;
			//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
			//结束字符（16H）
				i+=4;
				i-=2;
				p8Data[1]=i;
				p8Data[2]=i>>8;
				Uart_698_HCSFCS(p8Data);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
					
				if(Err==0)
				{
					if(ProxyPORTn==ACSAMPLEPORT)
					{//交采口
						x=Get_ADDR_UARTnRx(ProxyPORTn);
						MW((u32)p8Data,x,i+2);
						Uart_698_Data(ProxyPORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
						if(UARTCtrlProxy->Task==2)//等待单帧数据发送
						{
							UARTCtrlProxy->Task=0;
							x=UARTCtrlProxy->TxByte;
							UARTCtrlProxy->TxByte=0;
							UARTCtrlProxy->ProxyTxRxByte=x;
							MR((u32)p8Data-4,Get_ADDR_UARTnTx(ProxyPORTn),x);
						}
						else
						{
							UARTCtrlProxy->ProxyTxRxByte=0;
						}
					}
					else
					{//其他口
						UARTCtrlProxy->ProxyTxRxByte=i+2+4;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
						UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
						NUM_ReTx=0;//代理重发次数
						p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//整个代理请求的超时时间
						while(1)
						{
	#ifndef LINUX
		p32=(u32*)ADDR_MS_ENTRY;		
		(*(void(*)())p32[115])();//Main_Thread; 115://主线程
	#else
		ms=(ms_Type *)Get_ms();
		ms->Main_Thread();
	#endif
							if(UARTCtrlProxy->ProxyTask==0)//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
							{
								if(UARTCtrlProxy->ProxyTxRxByte==0)
								{//无数据接收
									if(NUM_ReTx<NUMmax_ReTx)//代理重发次数
									{
										NUM_ReTx++;//代理重发次数
										UARTCtrlProxy->ProxyTxRxByte=i+2+4;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
										UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
										continue;
									}
								}
								break;
							}
						}
					}
				//代理返回数据
					if(UARTCtrlProxy->ProxyTxRxByte==0)
					{//无数据接收
						NUM_OAD=p8OAD[0];//当前需发送OAD个数及数值指针
						if(LENmax_TxSPACE<(1+(5*NUM_OAD)))
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						p8OAD++;
						for(i=0;i<NUM_OAD;i++)
						{
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=33;//请求超时 
							p8OAD+=4;
							p8OAD+=Get_DL698DataLen_S(p8OAD,0);//得到DL698数据类型长度(包括:类型字节和数据)
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
						}
					}
					else
					{
						p8Data-=4;//前有p8Data+=4;
						NUM_OAD=p8Data[17];//返回OAD个数
						if(LENmax_TxSPACE<1)
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						i=18;
						while(NUM_OAD--)
						{
							if(LENmax_TxSPACE<5)
							{
								LEN_TxAPDU=0;//发送缓冲不够
								return;
							}
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data+i,5);//4字节OAD+DAR
							i+=5;
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
						}
					}
				}
				else
				{//Err=1
						NUM_OAD=p8OAD[0];//当前需发送OAD个数及数值指针
						if(LENmax_TxSPACE<(1+(5*NUM_OAD)))
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						p8OAD++;
						for(i=0;i<NUM_OAD;i++)
						{
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=255;//其他错误
							p8OAD+=4;
							p8OAD+=Get_DL698DataLen_S(p8OAD,0);//得到DL698数据类型长度(包括:类型字节和数据)
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
						}
				}
				p8tx[3]++;//服务器个数+1
				p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//整个代理请求的超时时间
				if(p16[0]==0)
				{
					break;
				}
			}
			break;
		case 4://代理设置后读取若干个服务器的若干个对象属性请求       [4] ProxySetThenGetRequestList，
//ProxySetThenGetRequestList∷=SEQUENCE
//{
//  服务序号-优先级          PIID，
//  整个代理请求的超时时间   long-unsigned，
//  代理若干个服务器的对象属性设置后读取  SEQUENCE OF
//  {
//    一个目标服务器地址          TSA，
//    代理一个服务器的超时时间    long-unsigned，
//    若干个对象属性的设置后读取  SEQUENCE OF
//   {
//      设置的对象属性描述符   OAD，
//      及其设置数值           Data，
//      读取的对象属性描述符   OAD，
//      及其延时读取时间       unsigned
//    }
//  }
//}
//68 32 00 43 05 04 00 00 00 00 00 10 CB EF 09 04 0B 
//00 1E 整个代理请求的超时时间   long-unsigned
//01  代理若干个服务器的对象属性设置后读取  SEQUENCE OF
//07 05 00 00 00 00 00 01 一个目标服务器地址          TSA
//00 00  代理一个服务器的超时时间    long-unsigned
//01  若干个对象属性的设置后读取  SEQUENCE OF
//40 00 02 00  设置的对象属性描述符   OAD
//1C 07 E1 07 02 0E 32 1A 及其设置数值           Data
//40 00 02 00  读取的对象属性描述符   OAD
//00  及其延时读取时间       unsigned
//00 98 CC 16 
//ProxySetThenGetResponseList∷=SEQUENCE
//{
//  服务序号-优先级-ACD   PIID-ACD，
//  代理若干个服务器的设置后读取结果  SEQUENCE OF
//  {
//一个目标服务器地址  TSA，
//若干个对象属性设置后读取结果  SEQUENCE OF
//{
//      设置的对象属性描述符  OAD，
//      及其设置结果          DAR，
//一个对象属性及其结果  A-ResultNormal 
//}
//  }
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=137;//代理响应        	[137]	PROXY-Response
			p8tx[1]=4;// [4] ProxySetThenGetRequestList
			p8tx[2]=p8rx[LEN_SA+8+2];//PIID-ACD
			LEN_TxAPDU=3;
			LENmax_TxSPACE-=LEN_TxAPDU;
			
			offset=LEN_SA+8+3;
			//整个代理请求的超时时间
			p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//得到UART秒定时器地址
			i=(p8rx[offset]<<8)|p8rx[offset+1];
			p16[0]=i;
			offset+=2;
			//服务器个数
			p8tx[3]=0;
			NUM_TSA=p8rx[offset];
			offset++;
			LEN_TxAPDU++;
			LENmax_TxSPACE--;
			while(NUM_TSA--)
			{
				// 一个目标服务器地址         TSA
				p16=(u16*)(ADDR_DATABUFF);
				p16[0]=0;
				p16[1]=0;
				p16[2]=0;
				i=p8rx[offset+1];//TSA字节数
				i++;
				MR(ADDR_DATABUFF,(u32)p8rx+offset+2,i);
				UARTCtrl->RMAddr[0]=p16[0];
				UARTCtrl->RMAddr[1]=p16[1];
				UARTCtrl->RMAddr[2]=p16[2];
				
				SETno=AddrToMeterSetNo((u16*)(ADDR_DATABUFF));//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=RMNmax表示无效
				Err=1;//置错误
				if(SETno<NUM_RMmax)
				{//找到配置序号
					p8=(u8*)ADDR_6000_SDRAM+(SETno*LENper_6000);
					if(p8[0]==DataType_structure)
					{//配置有效
						p8=Get_Element(p8+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
						if(p8)
						{//找到端口号
							ProxyPORTn=(p8[1]<<24)+(p8[2]<<16)+(p8[3]<<8)+p8[4];//端口OAD
							ProxyPORTn=OADtoPORTn(ProxyPORTn);//OAD值转为通信口号
							if(ProxyPORTn==ACSAMPLEPORT)
							{
								UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ProxyPORTn);
								Err=0;
							}
						#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT)||(ProxyPORTn==RS485_4PORT))
						#endif
						#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT))
						#endif
						#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT)||(ProxyPORTn==RS485_4PORT))
						#endif
						#if ((Project/100)<2)||((Project/100)>4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
							if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT))
						#endif
							{
								UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ProxyPORTn);
								if(UARTCtrlProxy->Function)//口功能 0=终端维护口,!=0终端抄表口
								{
									if(UARTCtrlProxy->AutoSearchTask==0)//自动搜表任务:0=空,1=等待,2...过程
									{
										UARTCtrlProxy->ProxyPORTn=PORTn;//发起代理的端口号
										p8=(u8*)ADDR_6000_SDRAM+(SETno*LENper_6000);
										p8=Get_Element(p8+5,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
										if(p8)
										{//波特率
											i=p8[1];
											switch(i)
											{
												case 0://300
												case 1://600
												case 2://1200
												case 3://2400
												case 4://4800
												case 5://7200
												case 6://9600
												case 7://19200
												case 8://38400
												case 9://57600
												case 10://115200
													UARTCtrlProxy->ProxyBpsCtrl=(0xb+(i<<5));
													break;
												case 255://自适应
												default:
													UARTCtrlProxy->ProxyBpsCtrl=RS485DefaultBPS;//RS485口默认的速率控制码0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
													break;
											}
											UARTCtrlProxy->ProxyRMprotocol=p8[3];//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
										}
										Err=0;
									}
								}
							}
						}
					}
				}
				i=p8rx[offset];//TSA字节数
				i++;
				if(LENmax_TxSPACE<i)
				{
					LEN_TxAPDU=0;//发送缓冲不够
					break;
				}
				MR((u32)p8tx+LEN_TxAPDU,(u32)p8rx+offset,i);
				offset+=i;
				LEN_TxAPDU+=i;
				LENmax_TxSPACE-=i;
				//代理一个服务器的超时时间
				i=(p8rx[offset]<<8)|p8rx[offset+1];
				if(Err==0)
				{
					UARTCtrlProxy->ProxyOverTime=i;//代理1个服务器的超时时间秒
				}
				offset+=2;
				//SEQUENCE OF OAD
				p8OAD=p8rx+offset;//当前需发送OAD个数及数值指针
				NUM_OAD=p8rx[offset];
				offset+=1;
			//组发送帧
				p8Data[0]=0xfe;
				p8Data[1]=0xfe;
				p8Data[2]=0xfe;
				p8Data[3]=0xfe;
				p8Data+=4;
			//起始字符（68H）  1Byte
				p8Data[0]=0x68;
			//长度域L  2Byte(除起始字符和结束字符之外的帧字节数)
			//控制域C  1Byte
				p8Data[3]=0x43;
			//地址域A
				p8Data[4]=5;
				p8Data[5]=UARTCtrl->RMAddr[2]>>8;
				p8Data[6]=UARTCtrl->RMAddr[2];
				p8Data[7]=UARTCtrl->RMAddr[1]>>8;
				p8Data[8]=UARTCtrl->RMAddr[1];
				p8Data[9]=UARTCtrl->RMAddr[0]>>8;
				p8Data[10]=UARTCtrl->RMAddr[0];
			//客户机地址CA  1Byte
				p8Data[11]=CA;
			//帧头校验HCS  2Byte(帧头校验HCS为2字节，是对帧头部分除起始字符和HCS本身之外的所有字节的校验)
			//APDU
				p8Data[14]=6;//设置请求 			 [6]		SET-Request
				p8Data[15]=3;//[3] SetThenGetRequestNormalList
				UARTCtrl->PIID++;
				p8Data[16]=UARTCtrl->PIID&0x3f;//PIID
				p8Data[17]=NUM_OAD;
				
				i=0;
				for(x=0;x<NUM_OAD;x++)
				{
// 若干个设置后读取对象属性  SEQUENCE OF
// {
//		一个设置的对象属性   OAD，
//		数据                 Data，
//		一个读取的对象属性   OAD，
//		延时读取时间         unsigned
// }
					LEN_RSD=Get_DL698DataLen_S(p8rx+offset+i+4,0);//得到DL698数据类型长度(包括:类型字节和数据)
					i+=4+LEN_RSD+5;
				}
				if(i>(LEN_UART2Tx-(4+18+4)))
				{
					LEN_TxAPDU=0;
					break;
				}
				MR((u32)p8Data+18,(u32)p8rx+offset,i);
				offset+=i;
				i+=18;
			//时间标签
				p8Data[i]=0;
			//帧校验FCS  2Byte(是对整帧除起始字符、结束字符和FCS本身之外的所有字节的校验)
			//结束字符（16H）
				i+=4;
				i-=2;
				p8Data[1]=i;
				p8Data[2]=i>>8;
				Uart_698_HCSFCS(p8Data);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
					
				if(Err==0)
				{
					if(ProxyPORTn==ACSAMPLEPORT)
					{//交采口
						x=Get_ADDR_UARTnRx(ProxyPORTn);
						MW((u32)p8Data,x,i+2);
						Uart_698_Data(ProxyPORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
						if(UARTCtrlProxy->Task==2)//等待单帧数据发送
						{
							UARTCtrlProxy->Task=0;
							x=UARTCtrlProxy->TxByte;
							UARTCtrlProxy->TxByte=0;
							UARTCtrlProxy->ProxyTxRxByte=x;
							MR((u32)p8Data-4,Get_ADDR_UARTnTx(ProxyPORTn),x);
						}
						else
						{
							UARTCtrlProxy->ProxyTxRxByte=0;
						}
					}
					else
					{//其他口
						UARTCtrlProxy->ProxyTxRxByte=i+2+4;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
						UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
						NUM_ReTx=0;//代理重发次数
						p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//整个代理请求的超时时间
						while(1)
						{
	#ifndef LINUX
		p32=(u32*)ADDR_MS_ENTRY;		
		(*(void(*)())p32[115])();//Main_Thread; 115://主线程
	#else
		ms=(ms_Type *)Get_ms();
		ms->Main_Thread();
	#endif
							if(UARTCtrlProxy->ProxyTask==0)//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
							{
								if(UARTCtrlProxy->ProxyTxRxByte==0)
								{//无数据接收
									if(NUM_ReTx<NUMmax_ReTx)//代理重发次数
									{
										NUM_ReTx++;//代理重发次数
										UARTCtrlProxy->ProxyTxRxByte=i+2+4;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
										UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
										continue;
									}
								}
								break;
							}
						}
					}
				//代理返回数据
					if(UARTCtrlProxy->ProxyTxRxByte==0)
					{//无数据接收
						NUM_OAD=p8OAD[0];//当前需发送OAD个数及数值指针
						if(LENmax_TxSPACE<(1+(11*NUM_OAD)))
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						p8OAD++;
						for(i=0;i<NUM_OAD;i++)
						{
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=33;//请求超时 
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
							p8OAD+=4;
							p8OAD+=Get_DL698DataLen_S(p8OAD,0);//得到DL698数据类型长度(包括:类型字节和数据)
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=0;//0=错误
							p8tx[LEN_TxAPDU+5]=33;//请求超时 
							LEN_TxAPDU+=6;
							LENmax_TxSPACE-=6;
						}
					}
					else
					{//有数据接收
						p8Data-=4;//前有p8Data+=4;
						NUM_OAD=p8Data[17];//返回OAD个数
						if(LENmax_TxSPACE<1)
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						i=18;
						while(NUM_OAD--)
						{
//      设置的对象属性描述符  OAD，
//      及其设置结果          DAR，
							if(LENmax_TxSPACE<5)
							{
								LEN_TxAPDU=0;//发送缓冲不够
								return;
							}
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data+i,5);//4字节OAD+DAR
							i+=5;
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
//一个对象属性及其结果  A-ResultNormal 
							if(p8Data[i+4]==0)
							{//返回错误
								x=6;//4字节OAD+2字节DAR
							}
							else
							{//返回数据
								x=Get_DL698DataLen_S(p8Data+i+4+1,0);//得到DL698数据类型长度(包括:类型字节和数据)
								x+=4+1;
							}
							if(LENmax_TxSPACE<x)
							{
								LEN_TxAPDU=0;//发送缓冲不够
								return;
							}
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data+i,x);
							i+=x;
							LEN_TxAPDU+=x;
							LENmax_TxSPACE-=x;
						}
					}
				}
				else
				{//Err=1
						NUM_OAD=p8OAD[0];//当前需发送OAD个数及数值指针
						if(LENmax_TxSPACE<(1+(11*NUM_OAD)))
						{
							LEN_TxAPDU=0;//发送缓冲不够
							break;
						}
						p8tx[LEN_TxAPDU]=NUM_OAD;
						LEN_TxAPDU+=1;
						LENmax_TxSPACE-=1;
						p8OAD++;
						for(i=0;i<NUM_OAD;i++)
						{
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=255;//其他错误
							LEN_TxAPDU+=5;
							LENmax_TxSPACE-=5;
							p8OAD+=4;
							p8OAD+=Get_DL698DataLen_S(p8OAD,0);//得到DL698数据类型长度(包括:类型字节和数据)
							MR((u32)p8tx+LEN_TxAPDU,(u32)p8OAD,4);
							p8tx[LEN_TxAPDU+4]=0;//0=错误
							p8tx[LEN_TxAPDU+5]=255;//其他错误
							LEN_TxAPDU+=6;
							LENmax_TxSPACE-=6;
						}
				}
				p8tx[3]++;//服务器个数+1
				p16=(u16*)Get_ADDR_UARTnTimer_S(PORTn);//整个代理请求的超时时间
				if(p16[0]==0)
				{
					break;
				}
			}
			break;
		case 5://代理操作若干个服务器的若干个对象方法请求             [5] ProxyActionRequestList，
//ProxyActionRequestList∷=SEQUENCE
//{
//  服务序号-优先级         PIID，
//  整个代理请求的超时时间  long-unsigned，
//  代理若干个服务器的对象方法操作  SEQUENCE OF
//  {
//    一个目标服务器地址            TSA，
//    代理一个服务器的超时时间      long-unsigned，
//    若干个对象方法描述符及其参数  SEQUENCE OF
//    {
//      对象方法描述符  OMD，
//      及其方法参数    Data
//    }
//  }
//}
//68 26 00 43 05 04 00 00 00 00 00 10 DB C0 09 05 0B 
//00 1E 整个代理请求的超时时间  long-unsigned
//01 代理若干个服务器的对象方法操作  SEQUENCE OF
//07 05 00 00 00 00 00 01 一个目标服务器地址            TSA
//00 00 代理一个服务器的超时时间      long-unsigned
//01 若干个对象方法描述符及其参数  SEQUENCE OF
//F3 00 04 00 对象方法描述符  OMD
//00 及其方法参数    Data
//00 6D FB 16 
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=137;//代理响应        	[137]	PROXY-Response
			p8tx[1]=5;// [5] ProxyActionRequestList
			p8tx[2]=p8rx[LEN_SA+8+2];//PIID-ACD
			LEN_TxAPDU=3;
			LENmax_TxSPACE-=LEN_TxAPDU;
			
