gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_PROXY.c
			offset=LEN_SA+8+3;
			//数据转发端口                  OAD，
			ProxyPORTn=(p8rx[offset]<<24)+(p8rx[offset+1]<<16)+(p8rx[offset+2]<<8)+p8rx[offset+3];//端口OAD
			MR((u32)p8tx+LEN_TxAPDU,(u32)p8rx+offset,4);
			offset+=4;
			LEN_TxAPDU+=4;
			LENmax_TxSPACE-=4;
			ProxyPORTn=OADtoPORTn(ProxyPORTn);//OAD值转为通信口号
		#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if((ProxyPORTn!=ACSAMPLEPORT)&&(ProxyPORTn!=RS485_1PORT)&&(ProxyPORTn!=RS485_2PORT)&&(ProxyPORTn!=RS485_4PORT))
		#endif
		#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if((ProxyPORTn!=ACSAMPLEPORT)&&(ProxyPORTn!=RS485_1PORT)&&(ProxyPORTn!=RS485_2PORT))
		#endif
		#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if((ProxyPORTn!=ACSAMPLEPORT)&&(ProxyPORTn!=RS485_1PORT)&&(ProxyPORTn!=RS485_2PORT)&&(ProxyPORTn!=RS485_4PORT))
		#endif
		#if ((Project/100)<2)||((Project/100)>4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if((ProxyPORTn==RS485_1PORT)||(ProxyPORTn==RS485_2PORT))
		#endif
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=255;//其它
				LEN_TxAPDU+=2;
				break;
			}
			UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ProxyPORTn);
			if(UARTCtrlProxy->Function==0)//口功能 0=终端维护口,!=0终端抄表口
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=255;//其它
				LEN_TxAPDU+=2;
				break;
			}
			if(UARTCtrlProxy->AutoSearchTask)//自动搜表任务:0=空,1=等待,2...过程
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=255;//其它
				LEN_TxAPDU+=2;
				break;
			}
			UARTCtrlProxy->ProxyPORTn=PORTn;//发起代理的端口号
			//D8-D5位表示波特率,O～7依次表示0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
			//波特率
			i=p8rx[offset];
			switch(i)
			{
				case 0://300
				case 1://600
				case 2://1200
				case 3://2400
				case 4://4800
				case 5://7200
				case 6://9600
				case 7://19200
				case 8://38400
				case 9://57600
				case 10://115200
					x=(0xb+(i<<5));
					break;
				case 255://自适应
				default:
					x=RS485DefaultBPS;//RS485口默认的速率控制码0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
					break;
			}
			x&=0xffe0;
			//D3位表示有无校验位0/1分别表示无/有
			//D2位表示偶／奇校验位0/1分别表示偶／奇校验
			//	校验位  ENUMERATED {无校验（0），奇校验（1），偶校验（2）}，
			i=p8rx[offset+1];
			switch(i)
			{
				case 0://无校验
					break;
				case 1://奇校验
					x|=0x0c;
					break;
				default://偶校验
					x|=0x08;
					break;
			}
			//D1-D0 数据位数0～3分别表示5-8位
			//	数据位  ENUMERATED {5（5），6（6），7（7），8（8）}，
			i=p8rx[offset+2];
			i-=5;
			i&=0x03;
			x|=i;
			//D4位表示停止位位数0/1分别表示1/2个停止位
			//	停止位  ENUMERATED {1（1），2（2）}，
			i=p8rx[offset+3];
			if(i==2)
			{
				x|=0x10;
			}
			//	流控    ENUMERATED {无(0)，硬件(1)，软件(2)}
			//仅电科院一致性测试时需要判别
			if(p8rx[offset+4]>2)
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=255;//其它
				LEN_TxAPDU+=2;
				break;
			}
			offset+=5;
			UARTCtrlProxy->ProxyBpsCtrl=x;
			UARTCtrlProxy->ProxyRMprotocol=0;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			//接收等待报文超时时间（秒）   long-unsigned
			//接收等待字节超时时间（毫秒） long-unsigned
			offset+=4;
			//透明转发命令 octet-string
			i=p8rx[offset];
			if((i&0x80)==0)
			{
				offset+=1;
			}
			else
			{
				i&=0x7f;
				if(i==1)
				{
					i=p8rx[offset+1];
					offset+=2;
				}
				else
				{
					i=(p8rx[offset+1]<<8)|p8rx[offset+2];
					offset+=3;
				}
			}
			//if(i>LEN_UART2FnDataBuff)
			if(i>LEN_UART2Tx)
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=255;//其它
				LEN_TxAPDU+=2;
				break;
			}
			//目的地址
			UARTCtrl->RMAddr[0]=0;//显示地址时用,载波口时目的地址用
			UARTCtrl->RMAddr[1]=0;//显示地址时用,载波口时目的地址用
			UARTCtrl->RMAddr[2]=0;//显示地址时用,载波口时目的地址用
			//查开始的0xfe个数
			for(x=0;x<i;x++)
			{
				if(p8rx[offset+x]!=0xfe)
				{
					break;
				}
			}
			TI=FrameProtocol(p8rx+offset+x,i-x);//通信协议自动识别:返回:0=未知,1=DL/T645-1997,2=DL/T645-2007,3=DL/T698.45,4=CJ/T 188-2004,128=DL376.2
			UARTCtrl->RMprotocol=TI;//通信协议自动识别:返回:0=未知,1=DL/T645-1997,2=DL/T645-2007,3=DL/T698.45,4=CJ/T 188-2004,128=DL376.2
			switch(TI)
			{
				case 1://DL/T645-1997
				case 2://DL/T645-2007
					MR((u32)&UARTCtrl->RMAddr,(u32)p8rx+offset+x+1,6);
					Data_Inverse((u32)&UARTCtrl->RMAddr,6);//数据倒序(高低字节调换),入口Le>=2
				#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
					if(ProxyPORTn==RS485_4PORT)
					{
						if((UARTCtrl->RMAddr[0]==0x9999)&&(UARTCtrl->RMAddr[1]==0x9999)&&(UARTCtrl->RMAddr[2]==0x9999))
						{//广播校时
							if(p8rx[offset+x+8]==8)
							{//控制码=8
								//其他任务
								TI=Check_OtherTask(ProxyPORTn);//检查是否有其他任务；返回:0=没,!=0有
								if(TI==0)
								{//无其他任务
									MR((u32)p8Data,(u32)p8rx+offset+x,i-x);
									UARTCtrlProxy->BroadcastTimeProxyTask=1;//代理透明转发广播校时任务:0=空,1=有代理
									UARTCtrlProxy->TaskID=(RMTASKnoPOWER<<8)+2;
									UARTCtrlProxy->BroadcastTimeTask=1;//广播校时任务:0=空,1=校时-2等待开始,2-127校时-2过程;0x81=校时-3等待开始,0x82-0xFF校时-3过程
									while(1)
									{
	#ifndef LINUX
		p32=(u32*)ADDR_MS_ENTRY;		
		(*(void(*)())p32[115])();//Main_Thread; 115://主线程
	#else
		ms=(ms_Type *)Get_ms();
		ms->Main_Thread();
	#endif
										if(UARTCtrlProxy->BroadcastTimeProxyTask==0)//代理透明转发广播校时任务:0=空,1=有代理
										{
											break;
										}
									}
								}
								//代理返回数据
								i=0;
								if((i+5)>LENmax_TxSPACE)
								{
									LEN_TxAPDU=0;
									break;
								}
								p8tx[LEN_TxAPDU]=1;//返回数据      [1] octet-string
								p8tx[LEN_TxAPDU+1]=0;
								LEN_TxAPDU+=2;
								TI=0;
								Uart_698_TxResponse(PORTn,TI,LEN_TxAPDU);//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
								return;
							}
						}
					}
				#endif
					break;
				case 3://DL/T698.45
					MR((u32)&UARTCtrl->RMAddr,(u32)p8rx+offset+x+5,6);
					Data_Inverse((u32)&UARTCtrl->RMAddr,6);//数据倒序(高低字节调换),入口Le>=2
				#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
					if(ProxyPORTn==RS485_4PORT)
					{
						if((p8rx[offset+x+4]==0xC0)&&(p8rx[offset+x+5]==0xAA)&&(p8rx[offset+x+9]==7))
						{//广播校时
							TI=p8rx[offset+x+12]<<24;
							TI|=p8rx[offset+x+13]<<16;
							TI|=p8rx[offset+x+14]<<8;
							TI|=p8rx[offset+x+15]<<0;
							if(TI==0x40007f00)
							{
								//其他任务
								TI=Check_OtherTask(ProxyPORTn);//检查是否有其他任务；返回:0=没,!=0有
								if(TI==0)
								{//无其他任务
									MR((u32)p8Data,(u32)p8rx+offset+x,i-x);
									UARTCtrlProxy->BroadcastTimeProxyTask=1;//代理透明转发广播校时任务:0=空,1=有代理
									UARTCtrlProxy->TaskID=(RMTASKnoPOWER<<8)+2;
									UARTCtrlProxy->BroadcastTimeTask=1;//广播校时任务:0=空,1=校时-2等待开始,2-127校时-2过程;0x81=校时-3等待开始,0x82-0xFF校时-3过程
									while(1)
									{
	#ifndef LINUX
		p32=(u32*)ADDR_MS_ENTRY;		
		(*(void(*)())p32[115])();//Main_Thread; 115://主线程
	#else
		ms=(ms_Type *)Get_ms();
		ms->Main_Thread();
	#endif
										if(UARTCtrlProxy->BroadcastTimeProxyTask==0)//代理透明转发广播校时任务:0=空,1=有代理
										{
											break;
										}
									}
								}
								//代理返回数据
								i=0;
								if((i+5)>LENmax_TxSPACE)
								{
									LEN_TxAPDU=0;
									break;
								}
								p8tx[LEN_TxAPDU]=1;//返回数据      [1] octet-string
								p8tx[LEN_TxAPDU+1]=0;
								LEN_TxAPDU+=2;
								TI=0;
								Uart_698_TxResponse(PORTn,TI,LEN_TxAPDU);//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
								return;
							}
						}
					}
				#endif
					break;
				case 128://DL376.2
					UARTCtrl->RMAddr[0]=0xFFFF;//显示地址时用,载波口时目的地址用
					UARTCtrl->RMAddr[1]=0xFFFF;//显示地址时用,载波口时目的地址用
					UARTCtrl->RMAddr[2]=0xFFFF;//显示地址时用,载波口时目的地址用
					break;
				
				case 4://CJ/T 188-2004
				default:
					if(ProxyPORTn==RS485_4PORT)
					{
						//无目的地址无法转
						p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
						p8tx[LEN_TxAPDU+1]=255;//其他错误 
						LEN_TxAPDU+=2;
						Uart_698_TxResponse(PORTn,TI,LEN_TxAPDU);//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
						return;
					}
					UARTCtrl->RMAddr[0]=0xEEEE;//显示地址时用,载波口时目的地址用
					UARTCtrl->RMAddr[1]=0xEEEE;//显示地址时用,载波口时目的地址用
					UARTCtrl->RMAddr[2]=0xEEEE;//显示地址时用,载波口时目的地址用
					break;
			}
			
			if(ProxyPORTn==ACSAMPLEPORT)
			{//交采口
				if(UARTCtrl->RMprotocol==3)//通信协议自动识别:返回:0=未知,1=DL/T645-1997,2=DL/T645-2007,3=DL/T698.45,4=CJ/T 188-2004,128=DL376.2
				{
					TI=Get_ADDR_UARTnRx(ProxyPORTn);
					MW((u32)p8rx+offset+x,TI,i-x);
					Uart_698_Data(ProxyPORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
					if(UARTCtrlProxy->Task==2)//等待单帧数据发送
					{
						UARTCtrlProxy->Task=0;
						x=UARTCtrlProxy->TxByte;
						UARTCtrlProxy->TxByte=0;
						UARTCtrlProxy->ProxyTxRxByte=x;
						MR((u32)p8Data,Get_ADDR_UARTnTx(ProxyPORTn),x);
					}
					else
					{
						UARTCtrlProxy->ProxyTxRxByte=0;
					}
				}
				else
				{
					UARTCtrlProxy->ProxyTxRxByte=0;
				}
			}
			else
			{//其他口
				MR((u32)p8Data,(u32)p8rx+offset,i);
				UARTCtrlProxy->ProxyTxRxByte=i;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
				UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
				
				NUM_ReTx=0;//代理重发次数
				while(1)
				{
	#ifndef LINUX
		p32=(u32*)ADDR_MS_ENTRY;		
		(*(void(*)())p32[115])();//Main_Thread; 115://主线程
	#else
		ms=(ms_Type *)Get_ms();
		ms->Main_Thread();
	#endif
					if(UARTCtrlProxy->ProxyTask==0)//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
					{
						if(UARTCtrlProxy->ProxyTxRxByte==0)
						{//无数据接收
							if(NUM_ReTx<NUMmax_ReTx)
							{
								NUM_ReTx++;//代理重发次数
								UARTCtrlProxy->ProxyTxRxByte=i;//代理数据字节数,发送和接收后数据在发起口的FnDataBuff
								UARTCtrlProxy->ProxyTask=1;//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
								continue;
							}
						}
						break;
					}
				}
			}
			
			//代理返回数据
			i=UARTCtrlProxy->ProxyTxRxByte;
			if(i==0)
			{
				p8tx[LEN_TxAPDU]=0;//错误信息      [0] DAR
				p8tx[LEN_TxAPDU+1]=33;//请求超时 
				LEN_TxAPDU+=2;
				break;
			}
			if((i+5)>LENmax_TxSPACE)
			{
				LEN_TxAPDU=0;
				break;
			}
			p8tx[LEN_TxAPDU]=1;//返回数据      [1] octet-string
			if(i<=127)
			{
				p8tx[LEN_TxAPDU+1]=i;
				LEN_TxAPDU+=2;
			}
			else
			{
				p8tx[LEN_TxAPDU+1]=0x82;
				p8tx[LEN_TxAPDU+2]=i>>8;
				p8tx[LEN_TxAPDU+3]=i;
				LEN_TxAPDU+=4;
			}
			MR((u32)p8tx+LEN_TxAPDU,(u32)p8Data,i);
			LEN_TxAPDU+=i;
			break;
		default:
			return;
	}
	TI=0;
	Uart_698_TxResponse(PORTn,TI,LEN_TxAPDU);//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
}































